balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC12F752.PIC
        <edc:SFRDef edc:access="nnnn----" edc:cname="FVRCON" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="FVRCON" edc:nzwidth="0x8" edc:por="0000----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="FVRBUFSS" edc:desc="" edc:mask="0x1" edc:name="FVRBUFSS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVRBUFEN" edc:desc="" edc:mask="0x1" edc:name="FVRBUFEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:desc="" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:desc="" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn--n--" edc:cname="DACCON0" edc:desc="" edc:impl="0xe4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--0--" edc:name="DACCON0" edc:nzwidth="8" edc:por="000--0--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACRNG" edc:desc="" edc:mask="0x1" edc:name="DACRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DACCON1" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DACCON1" edc:nzwidth="8" edc:por="---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CM2CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000100" edc:name="CM2CON0" edc:nzwidth="8" edc:por="00000100">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="C2CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C2SYNC" edc:desc="" edc:mask="0x1" edc:name="C2SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS" edc:desc="" edc:mask="0x1" edc:name="C2HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2SP" edc:desc="" edc:mask="0x1" edc:name="C2SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2ZLF" edc:desc="" edc:mask="0x1" edc:name="C2ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2POL" edc:desc="" edc:mask="0x1" edc:name="C2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OE" edc:desc="" edc:mask="0x1" edc:name="C2OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2ON" edc:desc="" edc:mask="0x1" edc:name="C2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn---n" edc:cname="CM2CON1" edc:desc="" edc:impl="0xf1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000---0" edc:name="CM2CON1" edc:nzwidth="8" edc:por="0000---0">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="C2CON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C2NCH0" edc:desc="" edc:mask="0x1" edc:name="C2NCH0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="C2PCH" edc:desc="" edc:mask="0x3" edc:name="C2PCH" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C2INTN" edc:desc="" edc:mask="0x1" edc:name="C2INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INTP" edc:desc="" edc:mask="0x1" edc:name="C2INTP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="C2PCH0" edc:desc="" edc:mask="0x1" edc:name="C2PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH1" edc:desc="" edc:mask="0x1" edc:name="C2PCH1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CM1CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000100" edc:name="CM1CON0" edc:nzwidth="8" edc:por="00000100">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="C1CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1SYNC" edc:desc="" edc:mask="0x1" edc:name="C1SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1HYS" edc:desc="" edc:mask="0x1" edc:name="C1HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1SP" edc:desc="" edc:mask="0x1" edc:name="C1SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1ZLF" edc:desc="" edc:mask="0x1" edc:name="C1ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1POL" edc:desc="" edc:mask="0x1" edc:name="C1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1OE" edc:desc="" edc:mask="0x1" edc:name="C1OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1ON" edc:desc="" edc:mask="0x1" edc:name="C1ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn---n" edc:cname="CM1CON1" edc:desc="" edc:impl="0xf1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000---0" edc:name="CM1CON1" edc:nzwidth="8" edc:por="0000---0">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="C1CON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1NCH0" edc:desc="" edc:mask="0x1" edc:name="C1NCH0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="C1PCH" edc:desc="" edc:mask="0x3" edc:name="C1PCH" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C1INTN" edc:desc="" edc:mask="0x1" edc:name="C1INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1INTP" edc:desc="" edc:mask="0x1" edc:name="C1INTP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="C1PCH0" edc:desc="" edc:mask="0x1" edc:name="C1PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH1" edc:desc="" edc:mask="0x1" edc:name="C1PCH1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CMOUT" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CMOUT" edc:nzwidth="8" edc:por="------00">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="MCOUT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MCOUT1" edc:desc="" edc:mask="0x1" edc:name="MCOUT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MCOUT2" edc:desc="" edc:mask="0x1" edc:name="MCOUT2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="2" edc:beginaddr="0x100" edc:endaddr="0x120" edc:regionid="sfr2">
        <edc:Mirror edc:nzsize="5" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="LATA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uu-uuu" edc:name="LATA" edc:nzwidth="8" edc:por="--xx-xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAN" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAN0" edc:desc="" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN1" edc:desc="" edc:mask="0x1" edc:name="IOCAN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN2" edc:desc="" edc:mask="0x1" edc:name="IOCAN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN3" edc:desc="" edc:mask="0x1" edc:name="IOCAN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN4" edc:desc="" edc:mask="0x1" edc:name="IOCAN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN5" edc:desc="" edc:mask="0x1" edc:name="IOCAN5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Mirror edc:nzsize="2" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="WPUA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="WPUA" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUA0" edc:desc="" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUA1" edc:desc="" edc:mask="0x1" edc:name="WPUA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUA2" edc:desc="" edc:mask="0x1" edc:name="WPUA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUA3" edc:desc="" edc:mask="0x1" edc:name="WPUA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUA4" edc:desc="" edc:mask="0x1" edc:name="WPUA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUA5" edc:desc="" edc:mask="0x1" edc:name="WPUA5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----n-n" edc:cname="SLRCONA" edc:desc="" edc:impl="0x5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----1-1" edc:name="SLRCONA" edc:nzwidth="8" edc:por="-----1-1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRA0" edc:desc="" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SLRA2" edc:desc="" edc:mask="0x1" edc:name="SLRA2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="------nn" edc:cname="PCON" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uu" edc:name="PCON" edc:nzwidth="8" edc:por="------qq">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="nBOR" edc:desc="" edc:mask="0x1" edc:name="nBOR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nPOR" edc:desc="" edc:mask="0x1" edc:name="nPOR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR2" edc:desc="" edc:mask="0xff" edc:name="TMR2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
