balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC12F752.PIC
          <edc:SFRDef edc:access="------nn" edc:cname="PMADRH" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PMADRH" edc:nzwidth="0x8" edc:por="------00">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMADRH" edc:desc="" edc:mask="0x3" edc:name="PMADRH" edc:nzwidth="2"/>
                <edc:AdjustPoint edc:offset="5"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PMDAT" edc:desc="" edc:name="PMDAT" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMDATL" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMDATL" edc:desc="" edc:mask="0xff" edc:name="PMDATL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="PMDATH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PMDATH" edc:nzwidth="0x8" edc:por="--000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMDATH" edc:desc="" edc:mask="0x3f" edc:name="PMDATH" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="COG1PH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="COG1PH" edc:nzwidth="8" edc:por="----xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1PH" edc:desc="" edc:mask="0xf" edc:name="G1PH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1PH0" edc:desc="" edc:mask="0x1" edc:name="G1PH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PH1" edc:desc="" edc:mask="0x1" edc:name="G1PH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PH2" edc:desc="" edc:mask="0x1" edc:name="G1PH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PH3" edc:desc="" edc:mask="0x1" edc:name="G1PH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1BLK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="COG1BLK" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1BLKF" edc:desc="" edc:mask="0xf" edc:name="G1BLKF" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="G1BLKR" edc:desc="" edc:mask="0xf" edc:name="G1BLKR" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1BLKF0" edc:desc="" edc:mask="0x1" edc:name="G1BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF1" edc:desc="" edc:mask="0x1" edc:name="G1BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF2" edc:desc="" edc:mask="0x1" edc:name="G1BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF3" edc:desc="" edc:mask="0x1" edc:name="G1BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR0" edc:desc="" edc:mask="0x1" edc:name="G1BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR1" edc:desc="" edc:mask="0x1" edc:name="G1BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR2" edc:desc="" edc:mask="0x1" edc:name="G1BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR3" edc:desc="" edc:mask="0x1" edc:name="G1BLKR3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1DB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="COG1DB" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1DBF" edc:desc="" edc:mask="0xf" edc:name="G1DBF" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="G1DBR" edc:desc="" edc:mask="0xf" edc:name="G1DBR" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1DBF0" edc:desc="" edc:mask="0x1" edc:name="G1DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF1" edc:desc="" edc:mask="0x1" edc:name="G1DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF2" edc:desc="" edc:mask="0x1" edc:name="G1DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF3" edc:desc="" edc:mask="0x1" edc:name="G1DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BDR0" edc:desc="" edc:mask="0x1" edc:name="G1BDR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BDR1" edc:desc="" edc:mask="0x1" edc:name="G1BDR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BDR2" edc:desc="" edc:mask="0x1" edc:name="G1BDR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BDR3" edc:desc="" edc:mask="0x1" edc:name="G1BDR3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1CON0" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1CS" edc:desc="" edc:mask="0x3" edc:name="G1CS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G1LD" edc:desc="" edc:mask="0x1" edc:name="G1LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POL0" edc:desc="" edc:mask="0x1" edc:name="G1POL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POL1" edc:desc="" edc:mask="0x1" edc:name="G1POL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1OE0" edc:desc="" edc:mask="0x1" edc:name="G1OE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1OE1" edc:desc="" edc:mask="0x1" edc:name="G1OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:desc="" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1CS0" edc:desc="" edc:mask="0x1" edc:name="G1CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1CS1" edc:desc="" edc:mask="0x1" edc:name="G1CS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1CON1" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1RS" edc:desc="" edc:mask="0x7" edc:name="G1RS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="G1FS" edc:desc="" edc:mask="0x7" edc:name="G1FS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="G1RSIM" edc:desc="" edc:mask="0x1" edc:name="G1RSIM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM" edc:desc="" edc:mask="0x1" edc:name="G1FSIM" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RS0" edc:desc="" edc:mask="0x1" edc:name="G1RS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RS1" edc:desc="" edc:mask="0x1" edc:name="G1RS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RS2" edc:desc="" edc:mask="0x1" edc:name="G1RS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FS0" edc:desc="" edc:mask="0x1" edc:name="G1FS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FS1" edc:desc="" edc:mask="0x1" edc:name="G1FS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FS2" edc:desc="" edc:mask="0x1" edc:name="G1FS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1ASD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1ASD" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1ASDSFLT" edc:desc="" edc:mask="0x1" edc:name="G1ASDSFLT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDSC1" edc:desc="" edc:mask="0x1" edc:name="G1ASDSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDSC2" edc:desc="" edc:mask="0x1" edc:name="G1ASDSC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDSHLT" edc:desc="" edc:mask="0x1" edc:name="G1ASDSHLT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDL0" edc:desc="" edc:mask="0x1" edc:name="G1ASDL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDL1" edc:desc="" edc:mask="0x1" edc:name="G1ASDL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ARSEN" edc:desc="" edc:mask="0x1" edc:name="G1ARSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDE" edc:desc="" edc:mask="0x1" edc:name="G1ASDE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8"/>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x40" edc:endaddr="0x70" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="gprnobank"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xF0" edc:endaddr="0x100" edc:regionid="gpr1" edc:shadowidref="gprnobank" edc:shadowoffset="0x0"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="gpr2" edc:shadowidref="gprnobank" edc:shadowoffset="0x0"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1F0" edc:endaddr="0x200" edc:regionid="gpr3" edc:shadowidref="gprnobank" edc:shadowoffset="0x0"/>
      <edc:EmulatorZone edc:beginaddr="0x19" edc:endaddr="0x20" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="COG1OUT0" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="CLKIN"/>
      <edc:VirtualPin edc:name="T1CKI"/>
      <edc:VirtualPin edc:name="C2IN1-"/>
      <edc:VirtualPin edc:name="RA5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="C1IN1-"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
      <edc:VirtualPin edc:name="COG1OUT1" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="COG1FLT" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="T1G" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="RA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="Vpp"/>
      <edc:VirtualPin edc:name="COG1FLT" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="T1G" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="RA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="COG1OUT0" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="INT"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="CCP1"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="C2OUT"/>
      <edc:VirtualPin edc:name="C1OUT"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="RA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="ICSPCLK"/>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="C2IN0-"/>
      <edc:VirtualPin edc:name="C1IN0-"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="RA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="ICSPDAT"/>
      <edc:VirtualPin edc:name="REFOUT"/>
      <edc:VirtualPin edc:name="DACOUT"/>
      <edc:VirtualPin edc:name="COG1OUT1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="C2IN0+"/>
      <edc:VirtualPin edc:name="C1IN0+"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="RA0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>